/* Assignment: 1
Author: Guy Shitrit, ID: 330707761
*/

#include <stdio.h>

int ex1() {
    char c;
    printf("Enter a character: ");
    scanf("%c", &c);

    /*
     * ידוע שאם נחרוג מערכי ascii של האותיות הלועזיות הקטנות, נקבל אותיות לא רצויות
    לכן, נחשב בצורה "מעגלית" על ידי:
    החסרת ערך הascii של האות הראשונה
    חילוק שארית במספר האותיות באנגלית
    ואז הוספת ערך הascii של האות הראשונה בחזרה

    זה מוודא שלא נחרוג מערכי הascii של האותיות הלועזיות בצורה מחזורית ע"י חילוק שארית
     */

    printf("%c", (c - 'a') % 26 + 'a');
    printf("%c", (c + 1 - 'a') % 26 + 'a');
    printf("%c", (c + 2 - 'a') % 26 + 'a');

    return 0;
}
